#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
random_password.flyte_db_password: Refreshing state... [id=none]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.185.40.70" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRQ2doaHVGQWVLMWpyb1dGb0JJaWd4REFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSaE56SmpOR001TmkwM05UUTVMVFF3WlRBdE9HSTFZeTAwTVdWaU1HRXdaRE13WkdNdwpJQmNOTWpNd056RXlNVGcwTURVMFdoZ1BNakExTXpBM01EUXhPVFF3TlRSYU1DOHhMVEFyQmdOVkJBTVRKR0UzCk1tTTBZemsyTFRjMU5Ea3ROREJsTUMwNFlqVmpMVFF4WldJd1lUQmtNekJrWXpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUorZzFTK3lsYWFjL2QwZWswYnBhRmhTSVlPdEZzRjVtZCtzTmJZRQpTVzNBYnh4YllLR3B1SDRBZHpsdHNpM3BjS3JtVUhrM3NuVWc3cnZ3Z1VqektRL2daczNVWmZWYzRUcmJNREpjClQybXFaWGRaMGc1dGV5RDROQVRIVlZpYTNBdy9WZE1KMEVVbEUzNG9rV0VReTI2dnh2UzBtWGRteUJkSHBudFgKYUY1MVN3ZFRncTUxYmsyNUNqblRiYzl1ZHJQUW45dG9UQTc2ekZPT3RSZWZhckV4ZTZOTnhzOEZ3QlZYblJqcgpHbTdLSFUxMHpoRUhmNzJJbVBtMWYvY3E1Szl6dXBrUTVCcFliblNDR2hGbjRIU0w5UWlSTWpDRUtKSGtobC9rCkc1ZHhZcTJWVllNcmN0allUT29hTzNwc0MxRjhzY2ZkeWhBT21NcVhySHRCdUZVaFhKYlVYR203MGV3NkpnUkgKYlFlVDFzR2ZvNW1wY0JlVWNiOFpuYWJzMGRZR3dYUWppaWROa2w5VEtjTWRDdXhqRHFjYlNiaGtaT1poTnFDdQpweVdDNmFKWjJWSmJ1cE9ZQVNDQm15WENMMzJnSXlwaGdCMTJpbFNCVm9kcU9zY1pOdWNQQS9MVnJhSzFqbXNrCmdLaEoxLzRNZ1UvdUpwMEE2ZjlpODg3a0d3SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVV1ak9tSnNXeG9XeXcxdVFFZW0wOGhoc3lKV3N3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFDUXYxTnBqcU5UUGxad216dXM4U0lRY0praWJMRjhReit3L0FuM2FvZXNMCnZSei85WC80RWFZWGVac1AwWUppQkxYTEFiZ3orcmJTZThNenRUWTZub3pLU2R5VCtUcXFLcWUvdVZJVjBZZWQKQmp0bU5oejFXcDNFYXZGTXJ3NUlmNkRqaUZEMVQyZkNSTlpnQU1CaVloZGJ3ekgwSHRQKzBSc0FTemNjQVJDZwpwUTJQUFdxWUR4V04ybyswM2Z0MVJtc1lzc05qRWFPYVVDTDA2SEVwMnFnNmxnQlYxOU8vRDNPbkwvaXo2YlpICk92MVZLY0l3NnZ3K2l6S2xJWWJ4eWk5UHUwT2M3dk1KRHNFdzR4aWhYRjJoTmF2Wkpud095T0hrQVU1RTQvVEcKSmJ3YjM2NmU0M2c3TFRrc1hNNEVpQWpMRUk4OHI0a29xdGdHRWNmMzZSNExJdndKWGZBUVM2TFcwVE4wK2hWYQprcnBteXo0cTFQdnp5UDhEK1NqdVpmOHg2YWV4eUdNNEVCeWtjZ2ErRWk4MnEwdTdPWmduZXh5dnhEajZLQTJnClIrL3VCd2duVXhoNW5yVGpLR05OeUNUV1ROMVIxMUUyQi83K2VTVWY5SU1pQXkyTGw4QXpkbDlQTHZ3dGttWG4KZ2F5bzAzVmhYTkplQWxnZlJlcHF4Zz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> 10 # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          - resource_labels   = {} -> null
          ~ service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (3 unchanged attributes hidden)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-cluster-flyte-np-0030c769-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-cluster-flyte-np-0030c769-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "flyte-np" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.26" -> null
          - public_endpoint         = "35.185.40.70" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # helm_release.flyte_single_cluster will be created
  + resource "helm_release" "flyte_single_cluster" {
      + atomic                     = false
      + chart                      = "flyteorg/flyte-binary"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flyte-test-setup"
      + namespace                  = "flyte"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flyteorg.github.io/flyte"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.1.10"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*